# View Position Failures Properties

Source: https://www.revitapidocs.com/2026/b65d4ca9-eaad-a540-f1dc-98823b2879e4.htm

---

| View Position Failures Properties |
| --- |

The BuiltInFailures ViewPositionFailures type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CantMoveViewport | Can't move Viewport when its placement is controlled by the assigned View Position. |
|  | CropRequiredAlignment | Can't move Viewport when its placement is controlled by the assigned View Position. |
|  | ViewAnchorDoesNotSupportView | The View Anchor ""%1!s!"" is not supported by view ""%2!s!"". |

Top See Also

#### Reference

BuiltInFailures ViewPositionFailures Class Autodesk.Revit.DB Namespace